wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_can.h
/* CAN_ERR0 */
#define CAN_ERR0_TECNT                 BITS(0, 7)                                        /*!< transmit error count defined by the CAN standard */
#define CAN_ERR0_RECNT                 BITS(8, 15)                                       /*!< receive error count defined by the CAN standard */
#define CAN_ERR0_TEFCNT                BITS(16, 23)                                      /*!< transmit error count for the data phase of FD frames with BRS bit set */
#define CAN_ERR0_REFCNT                BITS(24, 31)                                      /*!< receive error count for the data phase of FD frames with BRS bit set */

/* CAN_ERR1 */
#define CAN_ERR1_ERRSF                 BIT(1)                                            /*!< error summary flag */
#define CAN_ERR1_BOF                   BIT(2)                                            /*!< bus off flag */
#define CAN_ERR1_RS                    BIT(3)                                            /*!< receiving state */
#define CAN_ERR1_ERRSI                 BITS(4, 5)                                        /*!< error state indicator */
#define CAN_ERR1_TS                    BIT(6)                                            /*!< transmitting state */
#define CAN_ERR1_IDLEF                 BIT(7)                                            /*!< idle flag */
#define CAN_ERR1_RWERRF                BIT(8)                                            /*!< rx error warning flag */
#define CAN_ERR1_TWERRF                BIT(9)                                            /*!< tx error warning flag */
#define CAN_ERR1_STFERR                BIT(10)                                           /*!< stuff error */
#define CAN_ERR1_FMERR                 BIT(11)                                           /*!< form error */
#define CAN_ERR1_CRCERR                BIT(12)                                           /*!< CRC error */
#define CAN_ERR1_ACKERR                BIT(13)                                           /*!< ACK error */
#define CAN_ERR1_BDERR                 BIT(14)                                           /*!< bit dominant error for all format frames */
#define CAN_ERR1_BRERR                 BIT(15)                                           /*!< bit recessive error for all format frames */
#define CAN_ERR1_RWERRIF               BIT(16)                                           /*!< rx error warning interrupt flag */
#define CAN_ERR1_TWERRIF               BIT(17)                                           /*!< tx error warning interrupt flag */
#define CAN_ERR1_SYN                   BIT(18)                                           /*!< synchronization flag */
#define CAN_ERR1_BORF                  BIT(19)                                           /*!< bus off recovery flag */
#define CAN_ERR1_ERRFSF                BIT(20)                                           /*!< error summary flag for data phase of FD frames with BRS bit set */
#define CAN_ERR1_ERROVR                BIT(21)                                           /*!< error overrun */
#define CAN_ERR1_STFFERR               BIT(26)                                           /*!< stuff error in data phase of FD frames with BRS bit set */
#define CAN_ERR1_FMFERR                BIT(27)                                           /*!< form error in data phase of FD frames with BRS bit set */
#define CAN_ERR1_CRCFERR               BIT(28)                                           /*!< CRC error in data phase of FD frames with BRS bit set */
#define CAN_ERR1_BDFERR                BIT(30)                                           /*!< bit dominant error in data phase of FD frames with BRS bit set */
#define CAN_ERR1_BRFERR                BIT(31)                                           /*!< bit recessive error in data phase of FD frames with BRS bit set */

/* CAN_INTEN */
#define CAN_INTEN_MIE0                 BIT(0)                                            /*!< enable message 0 transmission and reception interrupt */
#define CAN_INTEN_MIE1                 BIT(1)                                            /*!< enable message 1 transmission and reception interrupt */
#define CAN_INTEN_MIE2                 BIT(2)                                            /*!< enable message 2 transmission and reception interrupt */
#define CAN_INTEN_MIE3                 BIT(3)                                            /*!< enable message 3 transmission and reception interrupt */
#define CAN_INTEN_MIE4                 BIT(4)                                            /*!< enable message 4 transmission and reception interrupt */
#define CAN_INTEN_MIE5                 BIT(5)                                            /*!< enable message 5 transmission and reception interrupt */
#define CAN_INTEN_MIE6                 BIT(6)                                            /*!< enable message 6 transmission and reception interrupt */
#define CAN_INTEN_MIE7                 BIT(7)                                            /*!< enable message 7 transmission and reception interrupt */
#define CAN_INTEN_MIE8                 BIT(8)                                            /*!< enable message 8 transmission and reception interrupt */
#define CAN_INTEN_MIE9                 BIT(9)                                            /*!< enable message 9 transmission and reception interrupt */
#define CAN_INTEN_MIE10                BIT(10)                                           /*!< enable message 10 transmission and reception interrupt */
#define CAN_INTEN_MIE11                BIT(11)                                           /*!< enable message 11 transmission and reception interrupt */
#define CAN_INTEN_MIE12                BIT(12)                                           /*!< enable message 12 transmission and reception interrupt */
#define CAN_INTEN_MIE13                BIT(13)                                           /*!< enable message 13 transmission and reception interrupt */
#define CAN_INTEN_MIE14                BIT(14)                                           /*!< enable message 14 transmission and reception interrupt */
#define CAN_INTEN_MIE15                BIT(15)                                           /*!< enable message 15 transmission and reception interrupt */
#define CAN_INTEN_MIE16                BIT(16)                                           /*!< enable message 16 transmission and reception interrupt */
#define CAN_INTEN_MIE17                BIT(17)                                           /*!< enable message 17 transmission and reception interrupt */
#define CAN_INTEN_MIE18                BIT(18)                                           /*!< enable message 18 transmission and reception interrupt */
#define CAN_INTEN_MIE19                BIT(19)                                           /*!< enable message 19 transmission and reception interrupt */
#define CAN_INTEN_MIE20                BIT(20)                                           /*!< enable message 20 transmission and reception interrupt */
#define CAN_INTEN_MIE21                BIT(21)                                           /*!< enable message 21 transmission and reception interrupt */
#define CAN_INTEN_MIE22                BIT(22)                                           /*!< enable message 22 transmission and reception interrupt */
#define CAN_INTEN_MIE23                BIT(23)                                           /*!< enable message 23 transmission and reception interrupt */
#define CAN_INTEN_MIE24                BIT(24)                                           /*!< enable message 24 transmission and reception interrupt */
#define CAN_INTEN_MIE25                BIT(25)                                           /*!< enable message 25 transmission and reception interrupt */
#define CAN_INTEN_MIE26                BIT(26)                                           /*!< enable message 26 transmission and reception interrupt */
#define CAN_INTEN_MIE27                BIT(27)                                           /*!< enable message 27 transmission and reception interrupt */
#define CAN_INTEN_MIE28                BIT(28)                                           /*!< enable message 28 transmission and reception interrupt */
#define CAN_INTEN_MIE29                BIT(29)                                           /*!< enable message 29 transmission and reception interrupt */
#define CAN_INTEN_MIE30                BIT(30)                                           /*!< enable message 30 transmission and reception interrupt */
#define CAN_INTEN_MIE31                BIT(31)                                           /*!< enable message 31 transmission and reception interrupt */

/* CAN_STAT */
#define CAN_STAT_MS0_RFC               BIT(0)                                            /*!< mailbox 0 state / clear rx fifo bit */
#define CAN_STAT_MS1_RES               BIT(1)                                            /*!< mailbox 1 state */
#define CAN_STAT_MS2_RES               BIT(2)                                            /*!< mailbox 2 state */
#define CAN_STAT_MS3_RES               BIT(3)                                            /*!< mailbox 3 state */
#define CAN_STAT_MS4_RES               BIT(4)                                            /*!< mailbox 4 state */
#define CAN_STAT_MS5_RFNE              BIT(5)                                            /*!< mailbox 5 state / rx fifo not empty */
#define CAN_STAT_MS6_RFW               BIT(6)                                            /*!< mailbox 6 state / rx fifo warning */
#define CAN_STAT_MS7_RFO               BIT(7)                                            /*!< mailbox 7 state / rx fifo overflow */
#define CAN_STAT_MS8                   BIT(8)                                            /*!< mailbox 8 state */
#define CAN_STAT_MS9                   BIT(9)                                            /*!< mailbox 9 state */
#define CAN_STAT_MS10                  BIT(10)                                           /*!< mailbox 10 state */
#define CAN_STAT_MS11                  BIT(11)                                           /*!< mailbox 11 state */
#define CAN_STAT_MS12                  BIT(12)                                           /*!< mailbox 12 state */
#define CAN_STAT_MS13                  BIT(13)                                           /*!< mailbox 13 state */
#define CAN_STAT_MS14                  BIT(14)                                           /*!< mailbox 14 state */
#define CAN_STAT_MS15                  BIT(15)                                           /*!< mailbox 15 state */
#define CAN_STAT_MS16                  BIT(16)                                           /*!< mailbox 16 state */
#define CAN_STAT_MS17                  BIT(17)                                           /*!< mailbox 17 state */
#define CAN_STAT_MS18                  BIT(18)                                           /*!< mailbox 18 state */
#define CAN_STAT_MS19                  BIT(19)                                           /*!< mailbox 19 state */
#define CAN_STAT_MS20                  BIT(20)                                           /*!< mailbox 20 state */
#define CAN_STAT_MS21                  BIT(21)                                           /*!< mailbox 21 state */
#define CAN_STAT_MS22                  BIT(22)                                           /*!< mailbox 22 state */
#define CAN_STAT_MS23                  BIT(23)                                           /*!< mailbox 23 state */
#define CAN_STAT_MS24                  BIT(24)                                           /*!< mailbox 24 state */
#define CAN_STAT_MS25                  BIT(25)                                           /*!< mailbox 25 state */
#define CAN_STAT_MS26                  BIT(26)                                           /*!< mailbox 26 state */
#define CAN_STAT_MS27                  BIT(27)                                           /*!< mailbox 27 state */
#define CAN_STAT_MS28                  BIT(28)                                           /*!< mailbox 28 state */
#define CAN_STAT_MS29                  BIT(29)                                           /*!< mailbox 29 state */
#define CAN_STAT_MS30                  BIT(30)                                           /*!< mailbox 30 state */
#define CAN_STAT_MS31                  BIT(31)                                           /*!< mailbox 31 state */

/* CAN_CTL2 */
#define CAN_CTL2_EFDIS                 BIT(11)                                           /*!< disable edge filtering */
#define CAN_CTL2_ISO                   BIT(12)                                           /*!< ISO CAN FD */
#define CAN_CTL2_PREEN                 BIT(14)                                           /*!< protocol exception detection enable by CAN standard */
#define CAN_CTL2_ITSRC                 BIT(15)                                           /*!< internal counter source */
#define CAN_CTL2_IDERTR_RMF            BIT(16)                                           /*!< IDE and RTR field filter type for rx mailbox reception */
#define CAN_CTL2_RRFRMS                BIT(17)                                           /*!< remote request frame is stored */
#define CAN_CTL2_RFO                   BIT(18)                                           /*!< receive filter order */
#define CAN_CTL2_ASD                   BITS(19, 23)                                      /*!< arbitration start delay */
#define CAN_CTL2_RFFN                  BITS(24, 27)                                      /*!< rx fifo filter number */
#define CAN_CTL2_BORIE                 BIT(30)                                           /*!< enable bus off recovery interrupt */
#define CAN_CTL2_ERRFSIE               BIT(31)                                           /*!< error summary interrupt enable bit for data phase of FD frames with BRS bit set */

/* CAN_CRCC */
#define CAN_CRCC_CRCTC                 BITS(0, 14)                                       /*!< transmitted CRC value for classical frames */
#define CAN_CRCC_ANTM                  BITS(16, 20)                                      /*!< associated number of mailbox for transmitting the CRCTC[14:0] value */

/* CAN_RFIFOPUBF */
#define CAN_RFIFOPUBF_FFD0             BIT(0)                                            /*!< rx fifo filter data bit 0 */
#define CAN_RFIFOPUBF_FFD1             BIT(1)                                            /*!< rx fifo filter data bit 1 */
#define CAN_RFIFOPUBF_FFD2             BIT(2)                                            /*!< rx fifo filter data bit 2 */
#define CAN_RFIFOPUBF_FFD3             BIT(3)                                            /*!< rx fifo filter data bit 3 */
#define CAN_RFIFOPUBF_FFD4             BIT(4)                                            /*!< rx fifo filter data bit 4 */
#define CAN_RFIFOPUBF_FFD5             BIT(5)                                            /*!< rx fifo filter data bit 5 */
#define CAN_RFIFOPUBF_FFD6             BIT(6)                                            /*!< rx fifo filter data bit 6 */
#define CAN_RFIFOPUBF_FFD7             BIT(7)                                            /*!< rx fifo filter data bit 7 */
#define CAN_RFIFOPUBF_FFD8             BIT(8)                                            /*!< rx fifo filter data bit 8 */
#define CAN_RFIFOPUBF_FFD9             BIT(9)                                            /*!< rx fifo filter data bit 9 */
#define CAN_RFIFOPUBF_FFD10            BIT(10)                                           /*!< rx fifo filter data bit 10 */
#define CAN_RFIFOPUBF_FFD11            BIT(11)                                           /*!< rx fifo filter data bit 11 */
#define CAN_RFIFOPUBF_FFD12            BIT(12)                                           /*!< rx fifo filter data bit 12 */
#define CAN_RFIFOPUBF_FFD13            BIT(13)                                           /*!< rx fifo filter data bit 13 */
#define CAN_RFIFOPUBF_FFD14            BIT(14)                                           /*!< rx fifo filter data bit 14 */
#define CAN_RFIFOPUBF_FFD15            BIT(15)                                           /*!< rx fifo filter data bit 15 */
#define CAN_RFIFOPUBF_FFD16            BIT(16)                                           /*!< rx fifo filter data bit 16 */
#define CAN_RFIFOPUBF_FFD17            BIT(17)                                           /*!< rx fifo filter data bit 17 */
#define CAN_RFIFOPUBF_FFD18            BIT(18)                                           /*!< rx fifo filter data bit 18 */
#define CAN_RFIFOPUBF_FFD19            BIT(19)                                           /*!< rx fifo filter data bit 19 */
#define CAN_RFIFOPUBF_FFD20            BIT(20)                                           /*!< rx fifo filter data bit 20 */
#define CAN_RFIFOPUBF_FFD21            BIT(21)                                           /*!< rx fifo filter data bit 21 */
#define CAN_RFIFOPUBF_FFD22            BIT(22)                                           /*!< rx fifo filter data bit 22 */
#define CAN_RFIFOPUBF_FFD23            BIT(23)                                           /*!< rx fifo filter data bit 23 */
#define CAN_RFIFOPUBF_FFD24            BIT(24)                                           /*!< rx fifo filter data bit 24 */
#define CAN_RFIFOPUBF_FFD25            BIT(25)                                           /*!< rx fifo filter data bit 25 */
#define CAN_RFIFOPUBF_FFD26            BIT(26)                                           /*!< rx fifo filter data bit 26 */
#define CAN_RFIFOPUBF_FFD27            BIT(27)                                           /*!< rx fifo filter data bit 27 */
#define CAN_RFIFOPUBF_FFD28            BIT(28)                                           /*!< rx fifo filter data bit 28 */
#define CAN_RFIFOPUBF_FFD29            BIT(29)                                           /*!< rx fifo filter data bit 29 */
#define CAN_RFIFOPUBF_FFD30            BIT(30)                                           /*!< rx fifo filter data bit 30 */
#define CAN_RFIFOPUBF_FFD31            BIT(31)                                           /*!< rx fifo filter data bit 31 */

/* CAN_RFIFOIFMN */
#define CAN_RFIFOIFMN_IDFMN            BITS(0, 8)                                        /*!< identifier filter matching number */

/* CAN_BT */
#define CAN_BT_PBS2                    BITS(0, 4)                                        /*!< phase buffer segment 2 */
#define CAN_BT_PBS1                    BITS(5, 9)                                        /*!< phase buffer segment 1 */
#define CAN_BT_PTS                     BITS(10, 15)                                      /*!< propagation time segment */
#define CAN_BT_SJW                     BITS(16, 20)                                      /*!< resynchronization jump width */
#define CAN_BT_BAUDPSC                 BITS(21, 30)                                      /*!< baud rate prescaler */

